{
  "Dockerfile.vim": { "branch": "master" },
  "coc.nvim": { "branch": "release" },
  "dhall-vim": { "branch": "master" },
  "editorconfig-vim": { "branch": "master" },
  "emmet-vim": { "branch": "master" },
  "instant.nvim": { "branch": "master" },
  "lalrpop.vim": { "branch": "master" },
  "lazy.nvim": { "branch": "main" },
  "nvim-dap": { "branch": "master" },
  "nvim-treesitter": { "branch": "master" },
  "nvim-treesitter-context": { "branch": "master" },
  "nvim-treesitter-textobjects": { "branch": "master" },
  "nvim-treesitter-textsubjects": { "branch": "master" },
  "nvim-ts-rainbow": { "branch": "master" },
  "octo.nvim": { "branch": "master" },
  "papercolor-theme": { "branch": "master" },
  "plenary.nvim": { "branch": "master" },
  "taboo.vim": { "branch": "master" },
  "tabular": { "branch": "master" },
  "tcomment_vim": { "branch": "master" },
  "telescope-fzy-native.nvim": { "branch": "master" },
  "telescope.nvim": { "branch": "master" },
  "undoquit.vim": { "branch": "main" },
  "vim-airline": { "branch": "master" },
  "vim-airline-themes": { "branch": "master" },
  "vim-bookmarks": { "branch": "master" },
  "vim-dispatch": { "branch": "master" },
  "vim-eunuch": { "branch": "master" },
  "vim-fugitive": { "branch": "master" },
  "vim-glsl": { "branch": "master" },
  "vim-jq": { "branch": "master" },
  "vim-markdown": { "branch": "master" },
  "vim-matchup": { "branch": "master" },
  "vim-nix": { "branch": "master" },
  "vim-surround": { "branch": "master" },
  "vim-windowswap": { "branch": "master" },
  "which-key.nvim": { "branch": "main" },
  "yesod.vim": { "branch": "master" }
}
