require 'socket'
# hack
def is_work?
  Socket.gethostname == 'thinpad.local'
end

if is_work?
  cask '1password'
  cask 'linear-linear'
  cask 'ngrok'
  cask 'slack'
else
  cask 'affinity-designer'
  cask 'affinity-photo'
  cask 'signal'
  # work manages this with mdm
  cask 'firefox'
  cask 'zotero'
  # non appstore bitwarden doesn't support browser integration
  mas 'bitwarden', id: 1352778147
end

# required by all the nonsense below
brew 'mas'

cask 'alacritty'
cask 'alt-tab'
cask 'inkscape'
cask 'dash'
cask 'element'
cask 'iterm2'
cask 'obs'
cask 'obsidian'
cask 'spotify'
cask 'unnaturalscrollwheels'
cask 'utm'
cask 'visual-studio-code'
cask 'vlc'
cask 'wireshark-app'
cask 'zoom'

mas 'Amphetamine', id: 937984704
# non appstore tailscale is missing some funny features. macs are silly.
mas 'Tailscale', id: 1475387142
